{
"_meta": {
    "sources": [
        {
            "json": "BensBrew",
            "abbreviation": "II",
            "full": "Introduction to Irin",
            "authors": [
                "Ben's Brew"],
            "version": "2.0.0",
            "color": "ffffff",
            "url": "https://github.com/samaxor/5eHomebrew",
            "dateReleased": "2023-06-01"}],
    "status": "wip",
    "dateAdded": 1685616852,
    "dateLastModified": 1685616852 },
    "race": [
        {    "name": "Dobutsu",
            "source": "BensBrew",
            "ability": [
                {   "wis": 2    }
            ],
            "size": [   "M"   ],
            "speed": 30,
            "darkvision": 60,
            "languageProficiencies": [   {
                    "common": true,
                    "sylvan": true   }   ],
            "skillProficiencies": [   {
                    "perception": true   }   ],
            "entries": [   {
                    "type": "entries",
                    "name": "Age",
                    "entries": [
                    "Dobutsu come of age in their teens and rarely exceed one century."    ]    },
                {
                    "type": "entries",
                    "name": "Alignment",
                    "entries": [
                        "Being so closely aligned with the fey, dōbutsu take after them and their chaotic natures."    ]    },
                {
                    "type": "entries",
                    "name": "Size",
                    "entries": [
                        "Dōbutsu vary from below five feet to seven feet tall. Your size is Medium."    ]    },
                {
                    "type": "entries",
                    "name": "Speed",
                    "entries": [
                        "Your base walking speed is 30 feet."    ]    },
                {
                    "type": "entries",
                    "name": "Beast Senses",
                    "entries":    [
                        "You are proficient in the Perception skill."    ]    },
                {
                    "type": "entries",
                    "name": "Darkvision",
                    "entries":    [
                        "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."    ]    },
                {
                    "type": "entries",
                    "name": "Natural Weapons",
                    "entries":    [
                        "Your claws are natural weapons, which you can use to make unarmed strikes. If you hit with them, you deal slashing damage equal to 1d4 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike."    ]    },
                {
                    "type": "entries",
                    "name": "Languages",
                    "entries":    [
                        "You can speak, read and write Common and Sylvan."    ]    },
                {
                    "type": "entries",
                    "name": "Subrace",
                    "entries":    [
                        "You may choose the type of dōbutsu you will be. There are four types: Neko, Kitsune, Okami or Usagi."    ]    }    ],
               "fluff":{
                    "entries": [
                        { "name": "Physical Description",
                        "entries": ["The dōbutsu look similar to humans, the big difference is they have a feature of an animal. The fur of the tail and the ears of a dōbutsu are said to be the most beautiful fur ever seen and they are sometimes killed for it. This part of the dōbutsu came from the large amount of fey blood in the veins of the dōbutsu. Their wild nature before the domestication causes the animistic traits of the dōbutsu. Not all dōbutsu look the same. dōbutsu all have claws due to the type of animal that the dōbutsu often look like."]   },
                        { "names": "History",
                        "entries": [ "They have a fey heritage that can be traced back to ancient fey that decided to breed with humans. The Dōbutsu worshipped the fey that had granted them the power, and various ritual were held to give praise to the fey that they worshipped. They were hunted for a time before people got a bit scared and began the enslavement and domestication. They were great hunters and the legends compare them to the archers of the elves. In modern times dōbutsu spend most of the years as slaves or pets to other races. The number of revolts goes up by day but not all dōbutsu hate their masters. The loyal Dōbutsu are known to still worship the fey while most have grown a hatred of the beings that gave them the stupid ears and tail." ]   },
                        { "names": "Society",
                        "entries": [ "Dōbutsus often have to deal with the constant reminder by other races that they are not equals. This fact often leaves them in places of enslavement, or in rebellions. The dōbutsu fear of being a weaker race also make them hard worker and push them to achieve something. In the beliefs of the dōbutsu, when one does obtain a goal of note they might change their name to one of a god or demon. No matter how much the dōbutsu may obtain they will still have a constant feeling that they should not hold political power. In the exception to this rule, dōbutsu that do create their own nation will often be isolated. The people that leave an isolated village might be hunted down to keep the secrets and tradition a mystery. The tribal beliefs of the dōbutsu resemble the American Indians and like the isolated country do not believe that they are inferior." ]  }
                    ]
               }        
           } ,
        {    "name": "Oni",
                "source": "BensBrew",
                "size":    [    "M"    ],
                "speed":    {   "walk": 30    },
                "ability":    [    {
                        "str": 1,
                        "con": 1    }
                ],
                "darkvision": 60,
                "languageProficiencies":    [    {
                        "common": true,
                        "celestial": true    }
                ],
                "resist":    [    "poison"    ],
                "entries":    [    {
                    "name": "Age",
                        "type": "entries",
                        "entries":
                        [
                            "Oni reach maturity about the same time as humans do, but their aging slows down drastically after that. Most live to about 1000 years old."    ]    },
                    {
                        "name": "Alignment",
                        "type": "entries",
                        "entries":    [
                            "Most oni are naturally evil. Their heightened sensitivity to the temptations of the Material Plane usually drives them to steal, fight and manipulate to get what they want."   ]    },
                    {
                        "type": "entries",
                        "name": "Size",
                        "entries":    [
                            "Oni are a sizeable people, reaching heights from 7 and 8 feet tall by maturity and weigh between 280 and 340 pounds. Your size is Medium."   ]    },
                    {
                        "name": "Darkvision",
                        "entries":
                        [
                            "As a creature of the night, you are very good at seeing in the dark. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."    ],
                        "type": "entries"    },
                    {
                        "name": "Yokai Resistance",
                        "entries":   [
                            "Thanks to the energy of the yokai, you have resistance to poison damage and advantage on saving throws against becoming poisoned."    ],
                        "type": "entries"    },
                    {
                        "name": "Powerful Build",
                        "entries":    [
                            "You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift."    ],
                        "type": "entries"    },
                    {
                        "name": "Supernatural Strength",
                        "entries":    [
                            "You can wield a weapon with the versatile property in one hand, but use the damage dice as if you were wielding it in two hands. In addition, Half-Oni's add their proficiency bonus to damage when making an unarmed attack."    ],
                        "type": "entries"    },
                    {
                        "name": "Languages",
                        "entries":    [
                            "You can speak, read and write, Common and Giant."    ],
                        "type": "entries"
                    }    ],
                "fluff":{
                    "entries": [
                        { "name": "Physical Description",
                            "entries": ["Oni are supernatural beings resembling demonic Ogres, but smaller in size. They have red, blue, or white skin, dark eyes with white pupils, and long, wild hair usually black or grey, occasionally white. Their distinguishing feature is a pair of short ivory horns that grow longer with age, which they take pride in and diligently polish. While they often mimic other humanoid species, some harmonious Oni adopt hybrid forms, blending in with host races while proudly displaying their distinctive horns."]   },
                        { "names": "History",
                            "entries": [ "At one time, the Oni guarded locations where the Spirit World overlapped with the Material Plane. Years on the Material Plane, however, corrupted some of the Oni splintering them into the three sub-races. The Oni corrupted by the material pleasures of the world became the Red Oni. The Oni corrupted by the power and knowledge of the world became the Blue Oni. The Oni that remained guard, resisting the temptations became the White Oni." ]   },
                        { "names": "Society",
                            "entries": [ "Oni primarily live solitary lives in the wilderness, only gathering with other Oni during annual revels. These gatherings, sometimes consisting of up to two hundred Oni, are highly anticipated and strictly forbid violence, with offenders having their horns sawed short and being exiled. Despite their shape-shifting abilities, Oni often face rejection and are shunned by settlements unless they prove themselves. Even when accepted, they rarely reveal their true form, opting for a hybrid appearance to ease others' discomfort or for personal gain." ]  }    ]   }    
            },
        {    "name": "Starforged",
            "source": "BensBrew",
            "ability": [
                {
                    "con": 2,
                    "choose": { "from": ["str", "dex", "int", "wis", "cha"], "count": 1}    }    ],
            "size": [    "M"    ],
            "speed": 30,
            "darkvision": 0,
            "traitTags": [
                "Natural Armor"    ],
            "languageProficiencies": [
                {
                    "common": true,
                    "anyStandard": 1    }    ],
            "resist": [ "cold" ],
            "entries":   [    {
                    "name": "Age",
                    "entries":    [
                        "After achieving sentience, starforged mature at the same age as humans. They can live until their core run out of energy, a process that can take up to 700 years."    ],
                    "type": "entries"    },
                {
                    "type": "entries",
                    "name": "Alignment",
                    "entries":    [
                        "Most starforged take comfort in order and discipline, tending toward law and neutrality, but some have absorbed the morality—or lack thereof—of the beings they served with."    ]    },
                {
                    "type": "entries",
                    "name": "Size",
                    "entries":    [
                        "Most starforged stand between 5 and 6½ feet tall. Your size is Medium."   ]    },
                {
                    "type": "entries",
                    "name": "Starforged Resilience",
                    "entries":    [
                        "Your constructed and cosmic nature grants you the following benefits:",
                        {
                            "type": "list",
                            "items":
                            [
                                "You have resistance to cold damage",
                                "You don't need to eat, drink, or breathe.",
                                "You are immune to disease.",
                                "You don't need to sleep and don't suffer the effects of exhaustion due to lack of rest, and magic can't put you to sleep."
                            ]
                        }
                    ]
                },
                {
                    "type": "entries",
                    "name": "Sentry's Rest",
                    "entries":
                    [
                        "When you take a long rest, you must spend at least six hours in an inactive, motionless state, rather than sleeping. In this state, you appear inert, but it doesn't render you {@condition unconscious}, and you can see and hear as normal."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Integrated Protection",
                    "entries":
                    [
                        "Your body is composed of metal, stone, and strands of starlight. When you aren't wearing armor, your AC is 13 + your Dexterity modifier. You can use your natural armor to determine your AC if the armor you wear would leave you with a lower AC. A shield's benefits apply as normal while you use your natural armor."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Languages",
                    "entries":
                    [
                        "You can speak, read, and write Common and one other language of your choice."
                    ]
                }
            ]
            },
        {   "name": "Automata",
            "source": "BensBrew",
            "ability": [    {
                    "con": 1,
                    "choose": {"from": ["str", "dex", "int", "wis", "cha"], 
                    "count": 1}}],
            "size": ["M"],
            "speed": 30,
            "darkvision": 0,
            "resist": ["poison"],
            "conditionImmune": ["disease"],
            "languageProficiencies": [{
                    "common": true,
                    "anyStandard": 1}],
            "entries": [
                {
                    "name": "Age",
                    "entries":
                    [
                        "Automatas don't age in the same way as other races do, but their body slowly decays if not taken care of properly. Automata can survive only for 5 to 50 years, depending on what it is made of, if it doesn't have access to the proper materials or tools required for its maintenance. After that time, it will crumble, rust or rot away. Proper maintenance can make an Automata immortal.",
                        "For the purpose of game mechanics, you're immune to biological aging, both magical and non-magical."
                    ],
                    "type": "entries"},
                {
                    "type": "entries",
                    "name": "Alignment",
                    "entries":
                    [
                        "Built as slaves or servants, most Automatas keep their 'rule - encased ' mentality even when free, and tend therefore towards lawful alignments. They don't seem to show a predilection for good or evil."
                    ]},
                {
                    "type": "entries",
                    "name": "Size",
                    "entries":
                    [
                        "An Automata's size can vary greatly, ranging from as little as 3 feet to more than 8. Your size is either Medium or Small (your choice). "
                    ]},
                {
                    "type": "entries",
                    "name": "Artificial being",
                    "entries":
                    [
                        "Even though you still count as a humanoid, your body doesn't work as the one of any other mortal race. You gain the following additional traits:",
                        {
                            "type": "list",
                            "items":
                            [
                                "You have advantage on saving throws against being poisoned, and you have resistance to poison damage.",
                                "You are immune to disease.",
                                "You can don only armor with which you have proficiency. To don armor other than a shield, you must incorporate it into your body over the course of 1 hour, during which you remain in contact with the armor. To doff armor, you must spend 1 hour removing it. You can rest while donning or doffing armor in this way.",
                                "While you live, the armor incorporated into your body can't be removed against your will."
                            ]
                        }
                    ]
                },
                {
                    "type": "entries",
                    "name": "Not far from humanoids.",
                    "entries":
                    [
                        "Even though you are not made of flesh and bone (at least in most cases), you still need to enter a 'sleeping ' state for 6 hours a day, like a normal person would, though it's more like a temporary shut-down to you. Most Automatas can't dream.','Also, you don't necessarily need to eat, but you do require to consume some kind of energy in order to keep yourself active: it could be sunlight, coal, or even food. The DM will decide whether your choice of power source is eligible or not. In order to keep all your systems functioning you also require air (be it for some kind of chemical/ magical/ photosynthetic reaction that happens inside you or something else) like a normal human would."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Languages",
                    "entries":
                    [
                        "You can speak, read, and write Common and one other language of your choice."
                    ]
                }
            ]
        }
        ],
    "subrace": [
                {    "name": "Neko",
                    "source": "BensBrew",
                    "raceName": "Dobutsu",
                    "raceSource": "BensBrew",
                    "fluff":
                    {
                        "entries":
                        [
                            "The neko have similarities to domesticated cats. People usually think of them as being weaker than the other dōbutsu. They often go adventuring having a super high chance of leaving home because of the curiosity inside them. The neko have tails and ears that are more glossy and often lick them. The nekos of the past often were seen with wild cats that seemed to be close companions."
                        ]
                    },
                    "ability":
                    [
                        {
                            "dex": 1
                        }
                    ],
                    "entries":
                    [
                        {
                            "name": "Naturally Graceful",
                            "type": "entries",
                            "entries":
                            [
                                "Cats always land on their feet. You have resistance to fall damage."
                            ]
                        },
                        {
                            "type": "entries",
                            "name": "Elusive",
                            "entries":
                            [
                                "Opportunity attacks against you have disadvantage."
                            ]
                        }
                    ]
                },
                {    "name": "Kitsune",
                    "source": "BensBrew",
                    "raceName": "Dobutsu",
                    "raceSource": "BensBrew",
                    "fluff":
                    {
                        "entries":
                        [
                            "The kitsune get traits resembling a fox yokai. They are more like tricksters than the other dōbutsu and have a higher chance of becoming chaotic. Kitsune fur has a large amount of magic made into it giving the appearance of glowing. The kitsune often tricks humans into falling in love with it then taking them out."
                        ]
                    },
                    "ability":
                    [
                        {
                            "cha": 1
                        }
                    ],
                    "entries":
                    [
                        {
                            "name": "Fox Tails",
                            "type": "entries",
                            "entries":
                            [
                                "You have the tail of a fox and gain an additional tail every other level until you have 9 tails. You can use your tail as if it were a spellcasting focus."
                            ]
                        },
                        {
                            "type": "entries",
                            "name": "Fox Illusion",
                            "entries":
                            [
                                "You know the minor illusion cantrip. At 5th level, you can cast the alter self spell once, requiring no material components, and you regain the ability to cast it this way when you finish a long rest. Charisma is your spellcasting ability for this spell."
                            ]
                        }
                    ]
                },
                {    "name": "Okami",
                    "source": "BensBrew",
                    "raceName": "Dobutsu",
                    "raceSource": "BensBrew",
                    "fluff":
                    {
                        "entries":
                        [
                            "The okami are the wolf of the dōbutsu world. They are super loyal and often are more lawful than chaotic. The okami fur is often wilder than the other subraces. In the past, they were the strongest warriors in the dōbutsu. They were as crazy as Norse berserkers but also had a strong scene of morals. They have mostly kept the same moral but some have twist law so that they may accomplish their goals."
                        ]
                    },
                    "ability":
                    [
                        {
                            "str": 1
                        }
                    ],
                    "entries":
                    [
                        {
                            "name": "Keen Ears",
                            "type": "entries",
                            "entries":
                            [
                                "You have advantage on Wisdom (Perception) checks that rely on hearing."
                            ]
                        },
                        {
                            "type": "entries",
                            "name": "Relentless Endurance",
                            "entries":
                            [
                                "When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can’t use this feature again until you finish a long rest."
                            ]
                        }
                    ]
                },
                {    "name": "Usagi",
                    "source": "BensBrew",
                    "raceName": "Dobutsu",
                    "raceSource": "BensBrew",
                    "fluff":
                    {
                        "entries":
                        [
                            "The Usagi have similarities to rabbits. People usually think of them as being weaker than the other dōbutsu. They often go adventuring having a super high chance of leaving home because of the curiosity inside them. The Usagi have tails and ears that are more glossy and often lick them. The Usagi of the past often were rarely seen unless to give aid to hurt or lost travelers."
                        ]
                    },
                    "ability":
                    [
                        {
                            "dex": 1
                        }
                    ],
                    "entries":
                    [
                        {
                            "name": "Nimble Climber",
                            "type": "entries",
                            "entries":
                            [
                                "Your limbs are strengthened by your animal aspect. You have a climbing speed equal to your walking speed."
                            ]
                        },
                        {
                            "type": "entries",
                            "name": "Rabbit's Agility",
                            "entries":
                            [
                                "Your reflexes and agility allow you to move with a burst of speed. When you move on your turn in combat, you can double your speed until the end of the tum. Once you use this trait, you can't use it again until you move 0 feet on one of your turns."
                            ]
                        }
                    ]
                },
                {    "name": "Aka Oni (Red Oni)",
                    "source": "BensBrew",
                    "raceName": "Oni",
                    "raceSource": "BensBrew",
                    "fluff":
                    {
                        "entries":
                        [
                            "The most common out of the oni, red oni or aka oni are known for their large size and toughness. They are slightly bigger than the rest of their kin, with skin coloration in shades of dark red. They are violent, hot-headed, and unfocused, often pursuing immediate satisfaction and disregarding long-term plots and schemes."
                        ]
                    },
                    "ability":
                    [
                        {
                            "dex": 1
                        }
                    ],
                    "entries":
                    [
                        {
                            "name": "The Revel Continues",
                            "entries":
                            [
                                "When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can’t use this feature again until you finish a long rest."
                            ],
                            "type": "entries"
                        }
                    ]
                },
                {    "name": "Ao Oni (Blue Oni)",
                    "source": "BensBrew",
                    "raceName": "Oni",
                    "raceSource": "BensBrew",
                    "ability":
                    [
                        {
                            "int": 1
                        }
                    ],
                    "fluff":
                    {
                        "entries":
                        [
                            "Blue oni or ao oni are known for their unnatural cunning and aptitude for magic. They are smaller than their red kin, though larger than their pale kin, and with skin coloration of shades of dark blue. They are usually calculating and meticulous pursuing lofty goals such as of power and knowledge."
                        ]
                    },
                    "entries":
                    [
                        {
                            "name": "Oni Magic.",
                            "entries":
                            [
                                "Blue oni can muster the innate magic within themselves which gets stronger as they grow in power. You know the dancing lights cantrip. When you reach 3rd level, you can cast the charm person spell once and need to finish a long rest before you can cast it again. Intelligence is your spellcasting ability for these spells."
                            ],
                            "type": "entries"
                        }
                    ]
                },
                {    "name": "Shiro Oni (White Oni)",
                    "source": "BensBrew",
                    "raceName": "Oni",
                    "raceSource": "BensBrew",
                    "ability":
                    [
                        {
                            "wis": 1
                        }
                    ],
                    "fluff":
                    {
                        "entries":
                        [
                            "Pale oni or shiro oni are known for their aloofness and connections to the spiritual realm. They are the smallest of oni, and are the fewest. Their skin can vary from pale white to light grey. Unlike the other oni, pale oni wish only to keep the balance between the Spirit World and the Material Plane. They usually guard locations where the presence of the Spirit World but sometimes adventure to seek artifacts of the spirit world or mend imbalances."
                        ]
                    },
                    "entries":
                    [
                        {
                            "name": "Spirit Walk.",
                            "entries":
                            [
                                "You teleport when you take the dash action."
                            ],
                            "type": "entries"
                        }
                    ]
                },
                {    "name": "Geo-Construct",
                    "source": "BensBrew",
                    "raceName": "Automata",
                    "raceSource": "BensBrew",
                    "entries":[{
                            "name": "Geo-Construct",
                            "type": "entries",
                            "entries":[
                                "You are composed of mostly inorganic matter, be it metal, stone or crystals. You gain the following traits:",{
                                    "type": "list",
                                    "items":[
                                        "You gain immunity to poison damage and the poisoned condition.",
                                        "You don't need to eat, drink, or breathe.",
                                        "When you are reduced to 0 hit points but not killed outright, you can use your reaction to drop to 1 hit point instead. You cannot use this feature again until you finish a long rest."
                                    ]
                                }]}]
                },
                {    "name": "Dendro-Contruct",
                    "source": "BensBrew",
                    "raceName": "Automata",
                    "raceSource": "BensBrew",
                    "entries":[{
                            "name": "Dendro-Construct",
                            "type": "entries",
                            "entries":[
                                "You are made of wood and other plant-derived materials, causing your body to work similarly to a plant. You gain the following traits:",{
                                    "type": "list",
                                    "items":[
                                        "You do not need to sleep. Instead, you can rest by doing light activity while remaining relative still (like keeping watch or reading a book).",
                                        "You do not need to eat or drink as long as you have access to sunlight or a good amount of soil.",
                                        "You can go 1 hour without breathing without suffering ill consequences.",
                                        "You gain proficiency in the Nature or Survival skills."]
                                }]}]
                },
                {    "name": "Necro-Construct",
                    "source": "BensBrew",
                    "raceName": "Automata",
                    "raceSource": "BensBrew",
                    "entries":[{
                            "name": "Necro-Construct",
                            "type": "entries",
                            "entries":[
                                "Your body is constructed using organic matter in the necromantic way, and thus share characteristics of an undead. You gain the following traits:",{
                                    "type": "list",
                                    "items":[
                                        "You gain resistance to necrotic damage.",
                                        "You have advantage on checks and saving throws to avoid exhaustion.",
                                        "You can go 1 hour without breathing without suffering ill consequences.",
                                        "You have some form of innate magic implanted into your system. You learn one cantrip. Choose the cantrip from the bard, cleric, druid, sorcerer, warlock, or wizard spell list. Your spellcasting ability for this cantrip depends on the spell list you chose from: Charisma for bard, sorcerer, or warlock; Wisdom for cleric or druid; or Intelligence for wizard."
                                    ]
                                }]}]
                }

        ],
    "background": [
            {
                "name": "Improved Background: Villager",
                "source": "BensBrew",
                "ability": [{"choose":
                    { "from":
                        [
                            "str",
                            "dex",
                            "con",
                            "int",
                            "wis",
                            "cha"
                        ],
                        "count": 2}}],
                "entries":
                [
                    "Improved Background. This feature replaces the background of your character. As a simple villager, you gain the following benefits:",
                    {
                        "type": "list",
                        "items":
                        [
                            "**Hardy body.** You gain a +2 bonus to all saving throws",
                            "**Untapped potential.** Increase any chosen ability score by 2, up to a maximum of 20."
                        ]
                    }
                ]
            },
            {
                "name": "Improved Background: Noble",
                "source": "BensBrew",
                "entries":
                [
                    "You grew up around wealth and nobility, thus gaining the following benefits:",
                    {
                        "type": "list",
                        "items":
                        [
                            "Well fed. You gain a +5 to your maximum health.",
                            "Noble blood. Increases any two different ability scores by 1, up to a maximum of 20. ",
                            "Noble education. You learn two additional languages or proficiencies."
                        ]
                    }
                ]
            },
            {
                "name": "Improved Background: Student",
                "source": "BensBrew",
                "entries":
                [
                    "You have spent most of your life dedicated to studying and acquiring knowledge. You start your adventure with the following benefits:",
                    {
                        "type": "list",
                        "items":
                        [
                            "Academic. You may select up to four skills, languages or tools to learn or be proficient in.",
                            "Diligent. Increase any chosen ability score by 1, up to a maximum of 20.",
                            "Knowledgeable. Choose a skill that you are already proficient in. Your proficiency bonus is  doubled for any ability check you make that uses that skill."
                        ]
                    }
                ]
            },
            {
                "name": "Improved Background: Soldier",
                "source": "BensBrew",
                "entries":
                [
                    "You received formal military training, improving your body and your discipline. You begin your adventure with the following benefits:",
                    {
                        "type": "list",
                        "items":
                        [
                            "Army training. You gain a +10 to your maximum health.",
                            "Disciplined. Increase your Strength or Constitution by 1, to a maximum of 20.",
                            "Military tactics. You gain proficiency in two of the following skills: Athletics, Intimation, Acrobatics, Survival. "
                        ]
                    }
                ]
            },
            {
                "name": "Improved Background: Mercenary",
                "source": "BensBrew",
                "entries":
                [
                    "You have completed many jobs and fought many battles for payment and wealth. You gain the following benefits:",
                    {
                        "type": "list",
                        "items":
                        [
                            "Fighting instinct. You gain a +2 bonus to saving throws against non-magical effects.",
                            "Mercenary workout. Increase your Strength or Dexterity by 1, to a maximum of 20.",
                            "Savvy travelled. Your walking speed increases by 5 feet."
                        ]
                    }
                ]
            },
            {
                "name": "Improved Background: Knight",
                "source": "BensBrew",
                "entries":
                [
                    "You are an honoured soldier, who fights with a purpose. You gain the following benefits:",
                    {
                        "type": "list",
                        "items":
                        [
                            "Swift reaction. You have advantage on all attacks of opportunity.",
                            "Knight's training. Increase your Strength, Dexterity or Constitution by 1, to a maximum of 20.",
                            "Supportive. When you take the help action, the creature you aid receives an additional +2 bonus to their ability check or attack roll."
                        ]
                    }
                ]
            },
            {
                "name": "Improved Background: Criminal",
                "source": "BensBrew",
                "entries":
                [
                    "You have some knowledge in the larcenous arts and committed some crimes with them. You gain the following benefits:",
                    {
                        "type": "list",
                        "items":
                        [
                            "Nimble feet. You gain a +5 bonus to initial rolls.",
                            "Criminal mind. Increase your Dexterity or Charisma by 1, to a maximum of 20.",
                            "Tricks of the trade. You gain proficiency in either Sleight of hand or Deception. If you already of proficiency in either one or both, you may choose to gain expertise instead."
                        ]
                    }
                ]
            },
            {
                "name": "Improved Background: Merchant",
                "source": "BensBrew",
                "entries":
                [
                    "You have experience in the world of trade and commerce. You gain the following benefits:",
                    {
                        "type": "list",
                        "items":
                        [
                            "Bang for your buck. You gain a +2 on skill checks related to bartering, selling and trading.",
                            "Inside trader. Increase your Charisma or Wisdom by 1, to a maximum of 20.",
                            "Its just business. You gain proficiency in either Insight or Persuasion. If you already of proficiency in either one or both, you may choose to gain expertise instead."
                        ]
                    }
                ]
            },
            {
                "name": "Improved Background: Artisan",
                "source": "BensBrew",
                "entries":
                [
                    "You have a strong desire to create and have dedicated your life to it. You gain the following benefits:",
                    {
                        "type": "list",
                        "items":
                        [
                            "Creator. You gain a +5 on skill checks related to crafting.",
                            "Skilled hands. Increase your Dexterity or Intelligence by 1, to a maximum of 20.",
                            "Tools of the trade. You gain proficiency in any two skills or tools. If you already of proficiency in a set of Artisan's tools, you may choose to gain expertise instead."
                        ]
                    }
                ]
            },
            {
                "name": "Improved Background: Scholar",
                "source": "BensBrew",
                "entries":
                [
                    "You have studied the arcane arts. You gain the following benefits:",
                    {
                        "type": "list",
                        "items":
                        [
                            "Researcher. You learn a cantrip from the wizard spell list. You cast it at character level",
                            "Diligent study. Increase your Constitution or Intelligence by 1, to a maximum of 20.",
                            "Verbose. You learn one additional language of your choice."
                        ]
                    }
                ]
            },
            {
                "name": "Improved Background: Nomad",
                "source": "BensBrew",
                "entries":
                [
                    "You are well acquainted with nature and animals. You gain the following benefits:",
                    {
                        "type": "list",
                        "items":
                        [
                            "Nature attuned. You learn a cantrip from the druid spell list. You cast it at character level.",
                            "Wild one. Increase your Dexterity or Wisdom by 1, to a maximum of 20.",
                            "Animal lover. You gain proficiency the Animal Handling skill. If you already have proficiency in Animal Handling, you may gain expertise in it instead."
                        ]
                    }
                ]
            },
            {
                "name": "Improved Background: Performer",
                "source": "BensBrew",
                "entries":
                [
                    "You have talent in the arts and self expression. You gain the following benefits:",
                    {
                        "type": "list",
                        "items":
                        [
                            "Harmonic tune. You learn a cantrip from the bard spell list. You cast it at character level.",
                            "Routine rehearsal. Increase your Constitution or Charisma by 1, to a maximum of 20.",
                            "Show off. You gain proficiency the Performance skill. If you already of proficiency in Performance, you may gain expertise in it instead."
                        ]
                    }
                ]
            },
            {
                "name": "Improved Background: Sage",
                "source": "BensBrew",
                "entries":
                [
                    "You have dedicated time to studying the Weave and all its magics. You gain the following benefits:",
                    {
                        "type": "list",
                        "items":
                        [
                            "Arcane analysis. You gain a +2 bonus to saving throws against spells.",
                            "Talented mind. Increase your Intelligence, Wisdom or Charisma by 1, to a maximum of 20.",
                            "Well studied. You gain proficiency in the Arcana skill. If you already have proficiency in Arcana, you may gain expertise in it instead."
                        ]
                    }
                ]
            },
            {
                "name": "Improved Background: Priest",
                "source": "BensBrew",
                "entries":
                [
                    "You have practiced faith and a talent for divine power. You gain the following benefits:",
                    {
                        "type": "list",
                        "items":
                        [
                            "Minor divinity. You learn a cantrip from the cleric spell list. You cast it at character level.",
                            "Blessed body. Increase your Wisdom or Charisma by 1, to a maximum of 20.",
                            "Faithful. You gain proficiency the Religion skill. If you already of proficiency in Religion, you may gain expertise in it instead."
                        ]
                    }
                ]
            },
            {
                "name": "Improved Background: Cultist",
                "source": "BensBrew",
                "entries":
                [
                    "You have researched the arcane in unconventional ways. You gain the following benefits:",
                    {
                        "type": "list",
                        "items":
                        [
                            "Otherworldly spark. You learn a cantrip from the warlock spell list. You cast it at character level.",
                            "Mystic mind. Increase your Intelligence or Charisma by 1, to a maximum of 20.",
                            "Unusual research. You gain proficiency in two of the following skills: Arcana, Religion, History or Medicine"
                        ]
                    }
                ]
            }
        ],
    "subclass": [
            {
                "name": "Protection Domain",
                "shortName": "Protection",
                "source": "BensBrew",
                "className": "Cleric",
                "classSource": "PHB",
                "additionalSpells": [
                    {
                        "prepared": {
                            "1": [
                                "Sanctuary",
                                "Shield of Faith"
                            ],
                            "3": [
                                "Aid",
                                "Warding Bond"
                            ],
                            "5": [
                                "Beacon of Hope",
                                "Glyph of Warding"
                            ],
                            "7": [
                                "Aura of Purity",
                                "Stoneskin"
                            ],
                            "9": [
                                "Circle of Power",
                                "Wall of Force"
                            ]
                        }
                    }
                ],
                "subclassFeatures": [
                "Protection Domain|Cleric|PHB|Protection|BensBrew|1",
                "Channel Divinity: Safeguard|Cleric|PHB|Protection|BensBrew|2",
                "Preservation|Cleric|PHB|Protection|BensBrew|6",
                "Divine Strike|Cleric|PHB|Protection|BensBrew|8",
                "Imposition of the Immortal|Cleric|PHB|Protection|BensBrew|17"
            ]
            },
            {
            "name": "Witchblade Sorcerous Origin",
            "shortName": "Witchblade",
            "source": "BensBrew",
            "className": "Sorcerer",
            "classSource": "PHB",
            "subclassFeatures":
            [
                "Arcane Warrior|Sorcerer||Witchblade|BensBrew|1",
                "War Witch|Sorcerer||Witchblade|BensBrew|6",
                "Magical Armament|Sorcerer||Witchblade|BensBrew|6",
                "Witch Walking|Sorcerer||Witchblade|BensBrew|14",
                "Magical Flurry|Sorcerer||Witchblade|BensBrew|18"
            ]
            }
        ],
    "subclassFeature": [
          {
            "name": "Protection Domain",
            "source": "BensBrew",
            "page": 1,
            "className": "Cleric",
            "classSource": "PHB",
            "subclassShortName": "Protection",
            "subclassSource": "BensBrew",
            "level": 1,
            "entries":
            [
                "Often manifested in clerics who worship Lord Ao or Chauntea, those under the protection domain try to heal the sick and prevent more harm. On account of this, they do not usually partake in causing even more harm, including to their enemies. They are pacifists who would prefer to talk things out, but still defend themselves when required. Very few will take arms against an enemy. Many will carry a simple dagger, but that can be used in a pinch to cut bandages. Others will stretch their calling into battle, bulking in armor and shields to not be hurt. Their way of thinking is that if they're unable to be hurt from a deadly blow, they can step in place of an attack to an ally.",
                {
                    "type": "table",
                    "caption": "Protection Domain Spells",
                    "colLabels":
                    [
                        "Cleric Level",
                        "Spells"
                    ],
                    "colStyles":
                    [
                        "col-3 text-center",
                        "col-9"
                    ],
                    "rows":
                    [
                        [
                            "1st",
                            "{@spell sanctuary}, {@spell shield of faith }"
                        ],
                        [
                            "3rd",
                            "{@spell aid}, {@spell warding bond}"
                        ],
                        [
                            "5th",
                            "{@spell beacon of hope}, {@spell glyph of warding}"
                        ],
                        [
                            "7th",
                            "{@spell aura of purity}, {@spell stoneskin}"
                        ],
                        [
                            "9th",
                            "{@spell circle of power}, {@spell wall of force}"
                        ]
                    ]
                },
                {
                    "type": "refSubclassFeature",
                    "subclassFeature": "Bonus Proficiency|Cleric||Protection|BensBrew|1"
                },
                {
                    "type": "refSubclassFeature",
                    "subclassFeature": "Shield the Defenseless|Cleric||Protection|BensBrew|1"
                }
            ]
        },
        {
            "type": "entries",
            "name": "Bonus Proficiency",
            "entries":
            [
                "At 1st level, you gain proficiency in heavy armor."
            ],
            "source": "BensBrew",
            "page": 1,
            "className": "Cleric",
            "classSource": "PHB",
            "subclassShortName": "Protection",
            "subclassSource": "BensBrew",
            "level": 1,
            "header": 1
        },
        {
            "type": "entries",
            "name": "Shield the Defenseless",
            "entries":
            [
                "From 1st level, you have been trained to be in the thick of battle, curing the wounds of the knights and paladins. You gain the protection fighting style. When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield. At 8th level, you no longer have to be within 5 feet of a creature to use this feature. Instead, a shield of radiance protects the creature. You must be within 30 feet of them, and must be able to see them."
            ],
            "source": "BensBrew",
            "page": 1,
            "className": "Cleric",
            "classSource": "PHB",
            "subclassShortName": "Protection",
            "subclassSource": "BensBrew",
            "level": 1,
            "header": 1
        },
        {
            "name": "Channel Divinity: Safeguard",
            "source": "BensBrew",
            "page": 1,
            "className": "Cleric",
            "classSource": "PHB",
            "subclassShortName": "Protection",
            "subclassSource": "BensBrew",
            "level": 2,
            "header": 2,
            "entries":
            [
                "Starting at 2nd level, you can make it harder for your friends to be harmed in battle. As an action, you may touch one friendly creature within 5 feet of you. Attack rolls against the selected creature have disadvantage until end of your next turn."
            ]
        },
        {
            "name": "Preservation",
            "source": "BensBrew",
            "page": 1,
            "className": "Cleric",
            "classSource": "PHB",
            "subclassShortName": "Protection",
            "subclassSource": "BensBrew",
            "level": 6,
            "header": 2,
            "entries":
            [
                "At 6th level, you can help preserve your allies on the battlefield or in a dungeon, where danger is everywhere. Whenever a creature within 30’ of you makes a saving throw, you can use your reaction to grant them advantage."
            ]
        },
        {
            "name": "Divine Strike",
            "source": "BensBrew",
            "page": 1,
            "className": "Cleric",
            "classSource": "PHB",
            "subclassShortName": "Protection",
            "subclassSource": "BensBrew",
            "level": 8,
            "header": 2,
            "entries":
            [
                "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 damage of the same type of damage by the weapon to the target. When you reach 14th level, the extra damage increases to 2d8."
            ]
        },
        {
            "name": "Imposition of the Immortal",
            "source": "BensBrew",
            "page": 1,
            "className": "Cleric",
            "classSource": "PHB",
            "subclassShortName": "Protection",
            "subclassSource": "BensBrew",
            "level": 17,
            "header": 2,
            "entries":
            [
                "Finally, at 17th level, you can now protect all of your allies on the battlefield from hostile foes. Whenever you use the Safeguard channel divinity, it instead affects all friendly creatures within 30 feet of the creature you touch."
            ]
        },
        {
            "name": "Arcane Warrior",
            "source": "BensBrew",
            "page": 2,
            "className": "Sorcerer",
            "classSource": "PHB",
            "subclassShortName": "Witchblade",
            "subclassSource": "BensBrew",
            "level": 1,
            "entries":
            [
                "At 1st level, you learn to ultilize simple magical effects as you fight:",
                "Arcane Defense. You may cast Mage Armor on yourself at will without using a spell slot.",
                "Martial Magics. You may use your Charisma modifier instead of Strength or Dexterity when you make an attack with a melee weapon.",
                "You gain proficiency with all simple and martial melee weapons.",
                "You may use a melee weapon as an arcane focus."
            ]
        },
        {
            "name": "War Witch",
            "source": "BensBrew",
            "page": 2,
            "className": "Sorcerer",
            "classSource": "PHB",
            "subclassShortName": "Witchblade",
            "subclassSource": "BensBrew",
            "level": 6,
            "entries":
            [
                "When you use your action to cast a sorcerer spell, you may make a melee weapon attack as a bonus action."
            ]
        },
        {
            "name": "Magical Armament",
            "source": "BensBrew",
            "page": 2,
            "className": "Sorcerer",
            "classSource": "PHB",
            "subclassShortName": "Witchblade",
            "subclassSource": "BensBrew",
            "level": 6,
            "entries":
            [
                "You may invoke magical weapons and armor at will as a bonus action. The magical armaments are often of an arcane appearance such as a whip of arcane energy or a cuirass of swirling shadows. The equipment vanishes if it leaves your immediate possession, if you die, or if you use this ability again.",
                "Magical Arms. You may create any one melee weapon or any two melee weapons with the light property. Created weapons are magical, but otherwise use standard weapon profiles.",
                "Magical Armor. You create and don a set of magical armor. While wearing the armor your base AC is 13 + your Charisma modifier. When you take damage, you may use your reaction and spend sorcery points to protect yourself. You may reduce the amount of damage taken by 5 for each sorcery point spent this way.",
                "You are proficient in wearing this armor. You may unsummon the armor as a bonus action."
            ]
        },
        {
            "name": "Witch Walking",
            "source": "BensBrew",
            "page": 2,
            "className": "Sorcerer",
            "classSource": "PHB",
            "subclassShortName": "Witchblade",
            "subclassSource": "BensBrew",
            "level": 14,
            "entries":
            [
                "You have the ability to blink around the battlefield. At either the beginning or the end of your turn, you may instantly teleport up to 15 feet to an unoccupied space that you can see. You may spend a sorcery point to blink at both the beginning and end of your turn."
            ]
        },
        {
            "name": "Magical Flurry",
            "source": "BensBrew",
            "page": 2,
            "className": "Sorcerer",
            "classSource": "PHB",
            "subclassShortName": "Witchblade",
            "subclassSource": "BensBrew",
            "level": 18,
            "entries":
            [
                "When you make a melee weapon attack using the War Witch feature, you may spend up to 2 sorcery points to make an additional attack for each point spent."
            ]
        }
        ]   
}
