{
"_meta": {
    "sources": [
        {
            "json": "BensBrew",
            "abbreviation": "SoS",
            "full": "Sagas of Starlight",
            "authors": [
                "Ben's Brew"
            ],
            "convertedBy": [
                "Ben's Brew"
            ],
            "version": "1.0",
            "targetSchema": "1.0"
        }
    ],
    "dateAdded": 0,
    "dateLastModified": 0
},
"race": [
    {
        "name": "Ravenfolk",
        "source": "BensBrew",
        "ability": [
            {
                "dex": 2,
                "choose": {
                    "from": [
                        "str",
                        "con",
                        "int",
                        "wis",
                        "cha"
                    ],
                    "count": 1,
                    "amount": 1
                }
            }
        ],
        "size": ["M"],
        "speed": 30,
        "darkvision": 60,
        "skillProficiencies": [   {
            "perception": true   }   ],
        
        "entries": [
            {
                "type": "entries",
                "name": "Age",
                "entries": [
                    "Ravenfolk reach adulthood at around 15 years of age. They live around 80 years"
                ]
            },
            {
                "type": "entries",
                "name": "Alignment",
                "entries": [
                    "The hunter culture is everything for a Ravenfolk. Meaning they respect their prey and enjoy pursuing it in nature. This respect for nature translates to a Neutral alignment, for as long as it is part of nature the Ravenfolk see it as correct and expected."
                ]
            },
            {
                "type": "entries",
                "name": "Size",
                "entries": [
                    "Ravenfolk usually range between 4.5 and 6.5 feet tall. Your size is Medium."
                ]
            },
            {
                "type": "entries",
                "name": "Speed",
                "entries": [
                    "Your base walking speed is 30 feet."
                ]
            },
            {
                "type": "entries",
                "name": "Hunting Heritage",
                "entries": [
                    " Thanks to the hunting culture, even a non dedicated Ravenfolk heard tales and stories about how to hunt and thrive in a forest. You have advantage on all Survival and Nature checks made on jungle, forests, or if it relates to hunting beasts."
                ]
            },
            {
                "type": "entries",
                "name": "Darkvision",
                "entries": [
                    "Accustomed to the jungle and the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You cannot discern colour in darkness,only shades of grey."
                ]
            },
            {
                "type": "entries",
                "name": "Keen Senses",
                "entries": [
                    "You have proficiency in the Perception skill."
                ]
            },
            {
                "type": "entries",
                "name": "On the Hunt",
                "entries": [
                    "If you take the Attack action on your first turn in combat, the attack deals an extra 1d6 damage to it. On your next turn, you have Advantage with Attack Rolls against the original target. You can use this trait only once per combat."
                ]
            },
            {
                "type": "entries",
                "name": "Languages",
                "entries": [
                    "You can speak, read and write Common. The way you speak it among Ravenfolk has a musical cadence to it."
                ]
            }
        ]
    },
    {
        "name": "Crimson Elves",
        "source": "BensBrew",
        "ability": [
            {
                "con": 2,
                "choose": {
                    "from": [
                        "str",
                        "dex",
                        "int",
                        "wis",
                        "cha"
                    ],
                    "count": 1,
                    "amount": 1
                }
            }
        ],
        "size": ["M"],
        "speed": 30,
        "skillProficiencies": [   {
            "perception": true   }   ],
        
        "entries": [
            {
                "type": "entries",
                "name": "Age",
                "entries": [
                    "Crimson Elves reach adulthood at around 20 years of age and live for around 700 years."
                ]
            },
            {
                "type": "entries",
                "name": "Alignment",
                "entries": [
                    "The strange rituals and relationships with creatures and flesh might make the Crimson Elves society seem evil from the eyes of outsiders, but their intentions are of balance and perpetuation of the nature of the Blood Moon. This tends the scale to a neutral view of the world for most of the Crimson Elves. "
                ]
            },
            {
                "type": "entries",
                "name": "Size",
                "entries": [
                    "Crimson Elves usually range between 4.5 and 6.5 feet tall. Your size is Medium."
                ]
            },
            {
                "type": "entries",
                "name": "Speed",
                "entries": [
                    "Your base walking speed is 30 feet."
                ]
            },
            {
                "type": "entries",
                "name": "Crimson Heritage",
                "entries": [
                    "The stories and myths around the Blood Moon elevate the crimson heritage into spirituality and a form of worship. Through tales and stories, you learned about the anatomy and functions of the body as well as how to study and learn more on your own. You have advantage on all Medicine checks as long as you use it on a creature in which you have killed and absorbed a Soul Sliver from another creature of the same species."
                ]
            },
            {
                "type": "entries",
                "name": "Fey Ancestry",
                "entries": [
                    " You have advantage on saving throws against being charmed, and magic cannot put you to sleep."
                ]
            },
            {
                "type": "entries",
                "name": "Keen Senses",
                "entries": [
                    "You have proficiency in the Perception skill."
                ]
            },
            {
                "type": "entries",
                "name": "Blood Ritual - Reaping of Souls.",
                "entries": [
                    "This basic Blood Ritual is taught to all young Crimson Elves as the beginning of their spiritual journey. Whenever you kill a creature, you may spend one minute performing a ritual to capture their blood and add it to your own body, obtaining power. Whenever you perform the ritual, you gain 1 Soul Sliver. You may spend 1 Soul Sliver as a Bonus Action to heal 1d4 Hit Points or add 1d4 Necrotic Damage to any damage roll you perform. You can hold up to 3 Soul Slivers within your blood."
                ]
            },
            {
                "type": "entries",
                "name": "Moon Trance",
                "entries": [
                    "Crimson Elves do not need to sleep; instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is “trance.”) While meditating, you dream of the Blood Moon; such dreams are a communion to the moon, a form of prayer and tribute."
                ]
            },
            {
                "type": "entries",
                "name": "Languages",
                "entries": [
                    "You can speak, read, and write Common as well the Crimson Language used to diffuse Blood Ritual."
                ]
            }
        ]
    },
    {
        "name": "Half-Estalar",
        "source": "BensBrew",
        "ability": [
            {
                "choose": {
                    "from": [
                        "str",
                        "dex",
                        "con",
                        "int",
                        "wis",
                        "cha"
                    ],
                    "count": 3,
                    "amount": 1
                }
            }
        ],
        "size": ["M"],
        "speed": 30,
        "skillProficiencies": [   {
            "perception": true   }   ],
        
        "entries": [
            {
                "type": "entries",
                "name": "Age",
                "entries": [
                    "Half-Estalar are considered adults around the age of 200 and can live to be a 1000 years old."
                ]
            },
            {
                "type": "entries",
                "name": "Alignment",
                "entries": [
                    "Due to their ancestry, the Half-Estalar usually prefer to watch over things than to be involved directly and, therefore take a neutral stance on most matters. There are those among them that have witnessed enough to know when it is the right time to intervene."
                ]
            },
            {
                "type": "entries",
                "name": "Size",
                "entries": [
                    "Crimson Elves usually range between 4.5 and 6.5 feet tall. Your size is Medium."
                ]
            },
            {
                "type": "entries",
                "name": "Speed",
                "entries": [
                    "Your base walking speed is 30 feet."
                ]
            },
            {
                "type": "entries",
                "name": "Ancient Heritage",
                "entries": [
                    "You have advantage on all History and Nature checks made on subjects that concern things that have been in place for more than a 100 years."
                ]
            },
            {
                "type": "entries",
                "name": "Advanced Darkvision",
                "entries": [
                    "Accustomed to the various amounts of light that can exist in various parts of the galaxy, the Half-Estalar can naturally see in dark and dim Conditions. You can see in both dim light and Darkness as if it were bright light. Also, your eyes faintly glow in the dark."
                ]
            },
            {
                "type": "entries",
                "name": "Observer of the Cosmos",
                "entries": [
                    "The Half-Estalar's unique anatomy, specifically the ornaments that are part of their head, allows them to perceive sound much easier than other creatures. They can hear at double the distances compared to a normal human. You have Proficiency in the Perception skill."
                ]
            },
            {
                "type": "entries",
                "name": "Always Watching",
                "entries": [
                    "You have advantage on saving throws against being Blinded, and magic can't make you Deafened."
                ]
            },
            {
                "type": "entries",
                "name": "Limited Telepathy",
                "entries": [
                    "You can telepathically communicate with a creature that is within 5 feet of you. You can use this feature a number of times equal to your proficiency. You regain all the charges for this trait after a Short or Long Rest."
                ]
            },
            {
                "type": "entries",
                "name": "Languages",
                "entries": [
                    "You can speak, read, and write Common, Celestial, and one more language of your choice. You can recognize a few words in Estalarian, but you cannot comprehend more than that due to how ancient and unknown the language is."
                ]
            }
        ]
    }
],
"subclass": [
    {
        "name": "Stalwart Defender",
        "source": "BensBrew",
        "className": "Fighter",
        "classSource": "PHB",
        "shortName": "Stalwart Defender",
        "subclassFeatures": [
            "Stalwart Defender|Fighter|PHB|Stalwart Defender|BensBrew|3",
            "Eclipse Technique|Fighter|PHB|Stalwart Defender|BensBrew|7",
            "Legendary Defender|Fighter|PHB|Stalwart Defender|BensBrew|10",
            "Combat Presence|Fighter|PHB|Stalwart Defender|BensBrew|15",
            "Ancient Survivor|Fighter|PHB|Stalwart Defender|BensBrew|18"
        ]
    }
],
"subclassFeature": [
    {
        "name": "Stalwart Defender",
        "source": "BensBrew",
        "className": "Fighter",
        "classSource": "PHB",
        "subclassShortName": "Stalwart Defender",
        "subclassSource": "BensBrew",
        "level": 3,
        "entries": [
            "Ancient paintings left behind showcase the movement, the posture, and the methods of how one should hold their shields high and protect those around the, Many schools of Stalwart Defenders can be found on the site of ancient ruins, trying to make sense of this fighting style of old. ",
            {
                "name": "Stalwart Shields - Sun and Moon",
                "type": "entries",
                "entries": [
                    "Beginning when you choose this archetype at 3rd level you learn the secret of the paintings, the Stalwart Shield's martial art. You may dual wield shields and whenever you do, select one to be the Sun shield and the other becomes the Moon shield.",
                    "• Sun Shield. You may attack using this shield as an improvised weapon that causes 1d8 Bludgeoning Damage and, if you do so, add your proficiency to the attack roll. Whenever you cause damage with the Sun Shield, you may push the target 5 feet away from you.",
                    "• Moon Shield. You can use your reaction to make an enemy reroll an attack aimed at you or any friendly creature in a 5-foot radius around you. You can only receive the Shield AC Bonus from the Moon Shield that you are wielding, and you receive a +1 to your attacks as long as you wield a Sun Shield paired with the Moon Shield."
                ]
            }
        ]
    },
    {
        "name": "Eclipse Technique",
        "source": "BensBrew",
        "className": "Fighter",
        "classSource": "PHB",
        "subclassShortName": "Stalwart Defender",
        "subclassSource": "BensBrew",
        "level": 7,
        "entries": [
            "Starting at 7th level, you learn to position the Moon Shield in front of the Sun shield, hiding its approach before you attack with it. As long as you are holding the Sun Shield and the Moon Shield, you can add your shield AC bonus to any damage roll caused by your Melee Attacks using the Sun Shield. You may use your Sun Shield attack as a Bonus Action."
        ]
    },
    {
        "name": "Legendary Defender",
        "source": "BensBrew",
        "className": "Fighter",
        "classSource": "PHB",
        "subclassShortName": "Stalwart Defender",
        "subclassSource": "BensBrew",
        "level": 10,
        "entries": [
            "At 10th level, you have embodied the heroes depicted in the legends, inspiring those around you. As long as you are holding the sun and moon shield pair, any friendly creature in a 10-foot radius around you shares the Armour Class bonus provided by your shield. If you or any friendly creature in this radius is hit by a melee attack, the target of that attack may spend a reaction to shove a creature 5 feet away from them as long as they are in range of their melee attacks. Finally, each friendly creature within range (this includes you) has advantage on Wisdom saving throws and death saving throws."
        ]
    },
    {
        "name": "Combat Presence",
        "source": "BensBrew",
        "className": "Fighter",
        "classSource": "PHB",
        "subclassShortName": "Stalwart Defender",
        "subclassSource": "BensBrew",
        "level": 15,
        "entries": [
            "Starting at 15th level, your presence in the battlefield can be felt by all. You may spend a reaction to reposition yourself, moving your full speed in the direction of a friendly creature, then if any hostile creatures are in range of your melee attacks, you may immediately make a melee attack against that hostile creature."
        ]
    },
    {
        "name": "Ancient Survivor",
        "source": "BensBrew",
        "className": "Fighter",
        "classSource": "PHB",
        "subclassShortName": "Stalwart Defender",
        "subclassSource": "BensBrew",
        "level": 18,
        "entries": [
            "At 18th level, you embody the hope expected from an ancient Stalwart Defender. At the start of each of your turns, you and any friendly creature in a 10-foot radius around you are inspired to keep on fighting, regaining Hit Points equal to your Proficiency modifier if you have more than half of your Hit Points left."
        ]
    }
]
}