{
	"_meta": {
		"sources": [{
			"json": "Feats",
			"abbreviation": "Feats",
			"full": "Feats",
			"authors": [
				"Ben's Brew"
			],
			"version": "1.0.0",
			"url": "https://github.com/samaxor/5eHomebrew",
			"targetSchema": "1.0.0"
		}],
		"dateAdded": 0,
		"dateLastModified": 0
	},
	"feat": [{
			"name": "Arcane Armour",
			"source": "Ben's Brew",
			"prerequisite": [{
				"spellcasting": true
			}],
			"entries": [
				"You manifest magic around you, granting you additional protection. While you are not wearing any armour, your base AC equals 10 + your Dexterity modifier + your spellcasting ability modifier."

			]
		},
		{
			"name": "Combat Champion",
			"source": "Ben's Brew",
			"ability": [{
				"choose": {
					"from": [
						"str",
						"dex"
					],
					"amount": 1
				}
			}],
			"entries": [
				"You know exactly what it takes to survive on the battlefield: training and reflexes. You gain the following benefits: ",
				{
					"type": "list",
					"items": [
						"You learn one fighting style of your choice from the fighter class. Not only that, but you cannot learn a fighting style that you already have picked before."
					]
				}
			]
		},
		{
			"name": "Corpsman",
			"source": "Ben's Brew",
			"ability": [{
				"wis": 1
			}],
			"entries": [
				"You master the physician’s arts, gaining the following benefits: ",
				{
					"type": "list",
					"items": [
						"You gain proficiency in the {@skill medicine} skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.",
						"During a short rest, you can clean and bind the wounds of up to six willing beasts and humanoids. Make a DC 15 Wisdom ({@skill medicine}) check for each creature. On a success, if a creature spends a Hit Die during this rest, that creature can forgo the roll and instead regain the maximum number of hit points the die can restore. A creature can do so only once per rest, regardless of how many Hit Dice it spends."
					]
				}
			],
			"skillProficiencies": [{
				"medicine": true
			}]
		},
		{
			"name": "Counter Strike",
			"source": "Ben's Brew",
			"prerequisite": [{
				"ability": [{
						"str": 13
					},
					{
						"dex": 13
					}
				]
			}],
			"ability": [{
				"choose": {
					"from": [
						"str",
						"dex"
					],
					"amount": 1
				}
			}],
			"entries": [
				"You can react to immediate danger with lethal force. You gain the following benefits: ",
				{
					"type": "list",
					"items": [
						"Whenever a creature attacks you, you can use your reaction to make one melee attack towards that creature."
					]
				}
			]
		},
		{
			"name": "Dual Caster",
			"source": "Ben's Brew",
			"prerequisite": [{
				"spellcasting": true
			}],
			"entries": [
				"You have mastered the ability to cast multiple spells at once. Whenever you use your action to cast a cantrip that deals damage as an action, you can cast an additional cantrip as a bonus action. The additional cantrip cannot cause damage in this way."

			]
		},
		{
			"name": "Dual Wield Master",
			"source": "Ben's Brew",
			"prerequisite": [{
				"ability": [{
					"dex": 13
				}]
			}],
			"entries": [
				"You are well practised with making rapid strikes with a weapon in your off-hand, and gain the following benefits. However, your second off-hand attack can not add special optional attacks like a paladin's smite.",
				{
					"type": "list",
					"items": [
						"If you use two-weapon fighting to use a bonus action to attack with a light weapon, you can attack twice with it instead of once. This can be done with a non-light weapon if used in conjunction with the feat Dual Wielder.",
						"If you throw a light weapon, you can draw another light weapon as part of the action. This can be done with a non-light weapon if used in conjunction with the feat Dual Wielder."
					]
				}
			]

		},
		{
			"name": "Magus",
			"source": "Ben's Brew",
			"ability": [{
				"choose": {
					"from": [
						"int",
						"wis"
					],
					"amount": 1
				}
			}],
			"entries": [
				"You study the arcane arts, gaining the following benefits:",
				{
					"type": "list",
					"items": [
						"You gain proficiency in the {@skill arcana} skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it.",
						"You learn the prestidigitation and detect magic spells. You can cast detect magic once without expending a spell slot, and you regain the ability to do so when you finish a long rest."
					]
				}
			]
		},
		{
			"name": "Weapon Artist",
			"source": "Ben's Brew",
			"prerequisite": [{
				"other": "Proficiency in the weapon type chosen "
			}],
			"ability": [{
				"choose": {
					"from": [
						"str",
						"dex"
					],
					"amount": 1
				}
			}],
			"entries": [
				"You have become an artist with your preferred type of weapon. You gain the following benefits: ",
				{
					"type": "list",
					"items": [
						"Choose a particular weapon type (i.e. long swords, spear, quarterstaff, short bow, etc). When you attack with your chosen weapon type, your critical range extends by 1, and you score a critical hit on a 19 or 20."
					]
				}
			]
		},
		{
			"name": "Zookeeper",
			"source": "Ben's Brew",
			"ability": [{
				"wis": 1
			}],
			"entries": [
				"You master the techniques needed to train and handle animals. You gain the following benefits.",
				{
					"type": "list",
					"items": [
						"You gain proficiency in the {@skill animal handling} skill. If you are already proficient in the skill, you add double your proficiency bonus to checks you make with it. ",
						"You can use a bonus action on your turn to command one friendly beast within 60 feet of you that can hear you and that isn’t currently following the command of someone else. You decide now what action the beast will take and where it will move during its next turn, or you issue a general command that lasts for 1 minute, such as to guard a particular area"
					]
				}
			]
		},
		{
			"name": "Surface Dweller",
			"source": "Ben's Brew",
			"prerequisite": [{
				"other": "Sunlight Sensitivity"
			}],
			"ability": [{
				"wis": 1
			}],
			"entries": [
				"You have spent enough time in the sun that you have grown accustomed to it. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You lost the Sunlight Sensitivity trait",
						"You gain proficiency with the {@skill perception} skill",
						"Once you take this feat, you learn the light cantrip if you do not already know it. Once you reach 5th level, you can also cast the spell daylight once per long rest. Wisdom is your spell casting ability modifier for these spells."
					]
				}
			]
		},
		{
			"name": "Improbable Strength",
			"source": "Ben's Brew",
			"prerequisite": [{
				"other": "Small sized race"
			}],
			"ability": [{
				"choose": {
					"from": [
						"str",
						"dex"
					],
					"amount": 1
				}
			}],
			"entries": [
				"You're unnaturally strong for your size. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You gain advantage on ability checks to escape from a grapple or the restrained condition",
						"You are considered one size larger for the purposes of grappling, shoving, carry weight, and wielding weapons. If you already have this benefit from a different source, or if you are under the 'enlarge' effect of the enlarge/reduce spell, you deal an extra 1d4 damage once per turn when you with a heavy and/or two-handed weapon."
					]
				}
			]
		},
		{
			"name": "Adapted to Darkness",
			"source": "Ben's Brew",
			"ability": [{
				"wis": 1
			}],
			"entries": [
				"You have learned to cope with the darkness to the extreme, honing your senses to supernatural levels and gaining the following benefits:",
				{
					"type": "list",
					"items": [
						"You gain Darkvision out to 30 feet. If you already have Darkvision, or gain it later from another source, increase the range of that Darkvision by 30 feet instead."
					]
				}
			]
		},
		{
			"name": "Adept Spellcraft",
			"source": "Ben's Brew",
			"prerequisite": [{
				"spellcasting": true
			}],
			"entries": [
				"Through hard work and dedication to the craft of spellcasting, you have learned to alter the effects of your spells, gaining the following benefits:",
				{
					"type": "list",
					"items": [
						"You learn a Metamagic option from the Metamagic list in the Sorcerer class except for Empowered Spell, Heightened Spell, or Quickened Spell. Replace Charisma in the Metamagic’s description with the spellcasting ability of the spell used, if different, and you may choose to spend the appropriate amount of Spellcraft Points (instead of Sorcery Points) to apply the effects of your Metamagic.",
						"You gain 2 Spellcraft Points, which you regain each time you complete a long rest. You may use these Spellcraft Points to fuel your Metamagic option chosen by this feat."
					]
				}
			]
		},
		{
			"name": "Bully",
			"source": "Ben's Brew",
			"entries": [
				"You’ve mastered the brutal art of kicking your opponent while they’re down and taking advantage of any and every opening you can find, gaining the following benefits:",
				{
					"type": "list",
					"items": [
						"You have advantage on opportunity attacks.",
						"You are granted an opportunity attack when a creature within your reach attempts to stand up from being prone.",
						"When you are granted an opportunity attack against a creature, instead of a melee attack you may choose to perform a shove attempt against that creature, with advantage on your roll."
					]
				}
			]
		},
		{
			"name": "Deadeye",
			"source": "Ben's Brew",
			"prerequisite": [{
				"ability": [{
						"str": 13
					},
					{
						"dex": 13
					}
				]
			}],
			"entries": [
				"Knives, darts, and javelins are playtoys to you, and you make it apparent with how easily and mind-boggling well you use them. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"The normal range of your thrown weapon attacks is increased by 10, and the maximum range is increased by 30.",
						"You may draw a weapon with the thrown property with a free hand after each attack you make with a weapon.",
						"You may choose to treat a ranged attack you make with a thrown weapon as a ranged weapon attack, applying the benefits of any racial, class, or feat abilities you have which affect your ranged attacks.",
						"Once on each of your turns when you hit with an attack made with a weapon with the thrown property, you may choose to make it a special ricochet attack, bouncing your weapon off the first target to hit another. Select another creature within the weapon’s normal throwing range of the original target of your attack, and if the original attack roll would have also hit that target, deal damage to it equal to the damage dice of the weapon, of its type. You must release the weapon from your hand if the triggering attack was a melee attack."
					]
				}
			]
		},
		{
			"name": "Element-Touched",
			"source": "Ben's Brew",
			"entries": [
				"You’ve become innately attuned to a certain elemental force, perhaps by distant blood, or perhaps due to a supernatural pact or event. Select acid, cold, fire, thunder, lightning, poison, radiant, or necrotic damage, and gain the following benefits based on your choice:",
				{
					"type": "list",
					"items": [
						"You have resistance to the chosen type of damage.",
						"When you score a critical hit with an attack roll, you deal an additional 1d4 damage of the chosen type."
					]
				}
			]
		},
		{
			"name": "Learned Caster",
			"source": "Ben's Brew",
			"prerequisite": [{
				"other": "The ability to learn spells or elemental disciplines from a list"
			}],
			"ability": [{
				"choose": {
					"from": [
						"int",
						"wis",
						"cha"
					],
					"amount": 1
				}
			}],
			"entries": [
				"You’ve toiled more than the average caster to perfect your magics, tapping into previously unknown powers and gaining the following benefits:",
				{
					"type": "list",
					"items": [
						"You learn an additional 2 level 5 or lower spells from one of your class spell lists of levels which you can cast for that class, or gain an additional 2 elemental disciplines for which you meet the requirements for.",
						"When you gain a level, you may choose to replace 1 of your known spells or elemental disciplines for a new one you meet the requirements for in that class."
					]
				}
			]
		},
		{
			"name": "One With the Sea",
			"source": "Ben's Brew",
			"ability": [{
				"choose": {
					"from": [
						"str",
						"con"
					],
					"amount": 1
				}
			}],
			"entries": [
				"Swimming and diving are sport to you, having expanded your lung capacity, perfected your stroke technique, and honed your senses to underwater dangers. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You may swim at your normal movement speed in any body of water with a current weaker than that of strong rapids.",
						"You may hold your breath twice as long as normal.",
						"You have advantage on all Constitution checks made to hold your breath, or to swim for an extended period of time.",
						"While actively searching, you have advantage on Wisdom (Perception) checks made to notice objects or creatures which are submerged in water."
					]
				}
			]
		},
		{
			"name": "Point Blank Shot",
			"source": "Ben's Brew",
			"ability": [{
				"choose": {
					"from": [
						"str",
						"con"
					],
					"amount": 1
				}
			}],
			"entries": [
				"You have adapted to fighting in close quarters, using smaller ranged weapons to angle effectively and fire rapidly. You gain the following benefits when using a ranged weapon without the Heavy property:",
				{
					"type": "list",
					"items": [
						"When attacking a creature within 30 feet of you with a ranged attack, neither being within 5 feet of a hostile creature, nor the target being prone, imposes the normal disadvantage to the attack roll.",
						"When a hostile creature’s movement would provoke an opportunity attack from you by leaving a space within 5 feet of you, you can use your reaction to make a ranged attack against that creature with a -5 penalty to the attack roll."
					]
				}
			]
		},
		{
			"name": "Second Skin",
			"source": "Ben's Brew",
			"ability": [{
				"choose": {
					"from": [
						"str",
						"dex"
					],
					"amount": 1
				}
			}],
			"entries": [
				"You’ve become so accustomed to wearing your armor that it no longer feels like it’s there to you, granting the following benefits:",
				{
					"type": "list",
					"items": [
						"You don and doff armor in half the normal time, or ¼ the time if assisted.",
						"You can don or doff a shield using your free item interaction for the turn, instead of as an action.",
						"While moving at half your normal speed or resting, you do not take any penalties or disadvantages to your ability checks normally imposed by wearing medium or heavy armor."
					]
				}
			]
		},
		{
			"name": "Skilled Worker",
			"source": "Ben's Brew",
			"ability": [{
				"choose": {
					"from": [
						"int",
						"wis"
					],
					"amount": 1
				}
			}],
			"entries": [
				"Through hard work and dedication to your trade, you become a cut above the rest of the craftsmen and gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You gain proficiency in one tool of your choice. Alternatively, you may select 1 of your current tool proficiencies and apply double your proficiency bonus when making ability checks using that tool.",
						"When you choose to craft during downtime using a tool you are proficient with, you craft at a rate of 10 + three times your level in gold pieces per day, instead of the normal amount.",
						"While crafting during downtime, you can now maintain a comfortable lifestyle at no cost."
					]
				}
			]
		},
		{
			"name": "Tactician",
			"source": "Ben's Brew",
			"prerequisite": [{
				"ability": [{
					"int": 13
				}]
			}],
			"entries": [
				"You have a mind for battle, using your superior intellect to predict your opponent’s moves before they make them, and prepare yourself for attack, gaining the following benefits:",
				{
					"type": "list",
					"items": [
						"You may use your Intelligence modifier in place of your Dexterity modifier when calculating your Armour Class, including while wearing armour but not when using alternate calculations to your Armour Cloass. Any maximum modifier bonus is still applied to the new ability modifier.",
						"When you are not surprised, before you roll initiative, you may take a -5 penalty to the roll to gain a +2 bonus to your Armor Class, as well as to all attack rolls adn saving throws you make, until the end of your first turn in combat."
					]
				}
			]
		},
		{
			"name": "Athlete (Improved)",
			"source": "Ben's Brew",
			"ability": [{
				"choose": {
					"from": [
						"str",
						"dex"
					],
					"amount": 1
				}
			}],
			"entries": [
				"You have undergone extensive physical training to gain the following benefits:",
				{
					"type": "list",
					"items": [
						"When you are {@condition prone}, standing up uses only 5 feet of your movement.",
						"Climbing doesn't cost you extra movement.",
						"You can make a running long jump or a running high jump after moving only 5 feet on foot, rather than 10 feet.",
						"Once per long rest, when you make an {@skill Athletics} or {@skill Acrobatics} check, you may choose to roll 1d6 and add it to the result. You must make this choice after seeing the roll, but before you know the results."
					]
				}
			]
		},
		{
			"name": "Charger (Improved)",
			"source": "Ben's Brew",
			"entries": [
				"When you use your action to {@action Dash}, you can use a bonus action to make one melee weapon attack or to {@action shove} a creature.",
				"If you move at least 10 feet in a straight line immediately before taking this bonus action, you either gain a +5 bonus to the attack's damage roll (if you chose to make a melee attack and hit) or push the target up to 10 feet away from you (if you chose to shove and you succeed).",
				"When you successfully shove a creature, you may also choose to deal 5 bludgeoning damage to it."
			]
		},
		{
			"name": "Dungeon Delver (Improved)",
			"source": "Ben's Brew",
			"entries": [
				"Alert to the hidden traps and secret doors found in many dungeons, you gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You have advantage on Wisdom ({@skill Perception}) and Intelligence ({@skill Investigation}) checks made to detect the presence of secret doors.",
						"You have advantage on saving throws made to avoid or resist traps.",
						"You have resistance to the damage dealt by traps.",
						"Traveling at a fast pace doesn't impose the normal -5 penalty on your passive Wisdom ({@skill Perception}) score.",
						"You have advantage on {@skill History} and {@skill Arcana} checks made to identify particular traps and dungeons."
					]
				}
			]
		},
		{
			"name": "Healer (Improved)",
			"source": "Ben's Brew",
			"entries": [
				"You are an able physician, allowing you to mend wounds quickly and get your allies back in the fight. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"When you use a {@item healer's kit|phb} to stabilize a dying creature, that creature also regains hit points equal to your level.",
						"As an action, you can spend one use of a {@item healer's kit|phb} to tend to a creature and restore {@dice 1d6 + 4} hit points to it, plus additional hit points equal to the creature's maximum number of Hit Dice. The creature can't regain hit points from this feat again until it finishes a short or long rest."
					]
				}
			]
		},
		{
			"name": "Heavy Armor Master (Improved)",
			"source": "Ben's Brew",
			"prerequisite": [{
				"proficiency": [{
					"armor": "heavy"
				}]
			}],
			"ability": [{
				"str": 1
			}],
			"entries": [
				"You can use your armor to deflect strikes that would kill others. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"While you are wearing heavy armor, all damage that you take is reduced by 3."
					]
				}
			]
		},
		{
			"name": "Linguist (Improved)",
			"source": "Ben's Brew",
			"ability": [{
				"int": 1
			}],
			"languageProficiencies": [{
				"any": 3
			}],
			"entries": [
				"You have studied languages and codes, gaining the following benefits:",
				{
					"type": "list",
					"items": [
						"You learn three languages of your choice.",
						"You can ably create written ciphers. Others can't decipher a code you create unless you teach them, they succeed on an Intelligence check (DC equal to your Intelligence score + your proficiency bonus), or they use magic to decipher it.",
						"Your mastery of language has afforded you a way with words. Once per long rest, when you make a Charisma ability check, you may choose to roll 1d6 and add it to the result. You must make this choice after seeing the roll, but before you know the results."
					]
				}
			]
		},
		{
			"name": "Savage Attacker (Improved)",
			"source": "Ben's Brew",
			"entries": [
				"Once per turn when you roll damage for a melee weapon attack, you can reroll the weapon's damage dice and use either total. Additionally, once per long rest, when you score a critical hit with an attack, you may choose to add a single additional weapon die of damage. You must make this decision after you see the attack roll, but before damage is rolled."
			]
		},
		{
			"name": "Tough (Improved)",
			"source": "Ben's Brew",
			"entries": [
				"Your hit point maximum increases by an amount equal to twice your level when you gain this feat. Whenever you gain a level thereafter, your hit point maximum increases by an additional 2 hit points. Additionally, once per long rest, you may choose to reroll a single death saving throw and use the higher result."
			]
		}
	]
}
