{
	"_meta": {
		"sources": [{
			"json": "Improved Backgrounds",
			"abbreviation": "Improved Backgrounds",
			"full": "Improved Backgrounds",
			"authors": [
				"Ben's Brew"
			],
			"version": "1.0.0",
			"url": "https://github.com/samaxor/5eHomebrew",
			"targetSchema": "1.0.0"
		}],
		"dateAdded": 0,
		"dateLastModified": 0
	},
	"background": [{
			"name": "Improved Background: Villager",
			"source": "Ben's Brew",
			"entries": [
				"Improved Background. This feature replaces the background of your character. As a simple villager, you gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Hardy body. You gain a +2 bonus to all saving throws",
						"Untapped potential. Increase any chosen ability score by 2, up to a maximum of 20."
					]
				}
			]
		},
		{
			"name": "Improved Background: Noble",
			"source": "Ben's Brew",
			"entries": [
				"You grew up around wealth and nobility, thus gaining the following benefits:",
				{
					"type": "list",
					"items": [
						"Well fed. You gain a +5 to your maximum health.",
						"Noble blood. Increases any two different ability scores by 1, up to a maximum of 20. ",
						"Noble education. You learn two additional languages or proficiencies."
					]
				}
			]

		},
		{
			"name": "Improved Background: Student",
			"source": "Ben's Brew",
			"entries": [
				"You have spent most of your life dedicated to studying and acquiring knowledge. You start your adventure with the following benefits:",
				{
					"type": "list",
					"items": [
						"Academic. You may select up to four skills, languages or tools to learn or be proficient in.",
						"Diligent. Increase any chosen ability score by 1, up to a maximum of 20.",
						"Knowledgeable. Choose a skill that you are already proficient in. Your proficiency bonus is  doubled for any ability check you make that uses that skill."
					]
				}
			]

		},
		{
			"name": "Improved Background: Soldier",
			"source": "Ben's Brew",
			"entries": [
				"You received formal military training, improving your body and your discipline. You begin your adventure with the following benefits:",
				{
					"type": "list",
					"items": [
						"Army training. You gain a +10 to your maximum health.",
						"Disciplined. Increase your Strength or Constitution by 1, to a maximum of 20.",
						"Military tactics. You gain proficiency in two of the following skills: Athletics, Intimation, Acrobatics, Survival. "
					]
				}
			]

		},
		{
			"name": "Improved Background: Mercenary",
			"source": "Ben's Brew",
			"entries": [
				"You have completed many jobs and fought many battles for payment and wealth. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Fighting instinct. You gain a +2 bonus to saving throws against non-magical effects.",
						"Mercenary workout. Increase your Strength or Dexterity by 1, to a maximum of 20.",
						"Savvy travelled. Your walking speed increases by 5 feet."
					]
				}
			]

		},
		{
			"name": "Improved Background: Knight",
			"source": "Ben's Brew",
			"entries": [
				"You are an honoured soldier, who fights with a purpose. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Swift reaction. You have advantage on all attacks of opportunity.",
						"Knight's training. Increase your Strength, Dexterity or Constitution by 1, to a maximum of 20.",
						"Supportive. When you take the help action, the creature you aid receives an additional +2 bonus to their ability check or attack roll."
					]
				}
			]

		},
		{
			"name": "Improved Background: Criminal",
			"source": "Ben's Brew",
			"entries": [
				"You have some knowledge in the larcenous arts and committed some crimes with them. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Nimble feet. You gain a +5 bonus to initial rolls.",
						"Criminal mind. Increase your Dexterity or Charisma by 1, to a maximum of 20.",
						"Tricks of the trade. You gain proficiency in either Sleight of hand or Deception. If you already of proficiency in either one or both, you may choose to gain expertise instead."
					]
				}
			]

		}

	]
}