{
	"_meta": {
		"sources": [{
			"json": "racecs",
			"abbreviation": "races",
			"full": "races",
			"authors": [
				"Ben's Brew"
			],
			"version": "1.0.0",
			"url": "https://github.com/samaxor/5eHomebrew",
			"targetSchema": "1.0.0"
		}],
		"dateAdded": 0,
		"dateLastModified": 0
	},
	"race": [{
			"name": "Dobutsu",
			"source": "Ben's Brew",
			"size": "M",
			"speed": {
				"walk": 30
			},
			"darkvision": 60,
			"ability": [{
				"wis": 2
			}],
			"languageProficiencies": [{
				"common": true,
				"sylvan": true
			}],
			"skillProficiencies": [{
				"perception": true
			}],

			"entries": [{
					"name": "Age",
					"type": "entries",
					"entries": [
						"Dōbutsu come of age in their teens and rarely exceed one century."
					]
				},
				{
					"name": "Alignment",
					"type": "entries",
					"entries": [
						"Being so closely aligned with the fey, dōbutsu take after them and their chaotic natures."
					]
				},
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"Dōbutsu vary from below five feet to seven feet tall. Your size is Medium."
					]
				},
				{
					"type": "entries",
					"name": "Speed",
					"entries": [
						"Your base walking speed is 30 feet."
					]
				},
				{
					"type": "entries",
					"name": "Beast Senses",
					"entries": [
						"You are proficient in the Perception skill."
					]
				},
				{
					"type": "entries",
					"name": "Darkvision",
					"entries": [
						"You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
					]
				},
				{
					"type": "entries",
					"name": "Natural Weapons",
					"entries": [
						"Your claws are natural weapons, which you can use to make unarmed strikes. If you hit with them, you deal slashing damage equal to 1d4 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike."
					]
				},
				{
					"type": "entries",
					"name": "Languages",
					"entries": [
						"You can speak, read and write Common and Sylvan."
					]
				},
				{
					"type": "entries",
					"name": "Subrace",
					"entries": [
						"You may choose the type of dōbutsu you will be. There are four types: Neko, Kitsune, Okami or Usagi."
					]
				}

			],
			"subraces": [{
					"name": "Neko",
					"source": "Ben's Brew",
					"fluff": {
						"entries": [
							"The neko have similarities to domesticated cats. People usually think of them as being weaker than the other dōbutsu. They often go adventuring having a super high chance of leaving home because of the curiosity inside them. The neko have tails and ears that are more glossy and often lick them. The nekos of the past often were seen with wild cats that seemed to be close companions."
						]
					},
					"ability": [{
						"dex": 1
					}],
					"entries": [{
							"name": "Naturally Graceful",
							"type": "entries",
							"entries": [
								"Cats always land on their feet. You have resistance to fall damage."
							]
						},
						{
							"type": "entries",
							"name": "Elusive",
							"entries": [
								"Opportunity attacks against you have disadvantage."
							]
						}
					]
				},
				{
					"name": "Kitsune",
					"source": "Ben's Brew",
					"fluff": {
						"entries": [
							"The kitsune get traits resembling a fox yokai. They are more like tricksters than the other dōbutsu and have a higher chance of becoming chaotic. Kitsune fur has a large amount of magic made into it giving the appearance of glowing. The kitsune often tricks humans into falling in love with it then taking them out."
						]
					},
					"ability": [{
						"cha": 1
					}],
					"entries": [{
							"name": "Fox Tails",
							"type": "entries",
							"entries": [
								"You have the tail of a fox and gain an additional tail every other level until you have 9 tails. You can use your tail as if it were a spellcasting focus."
							]
						},
						{
							"type": "entries",
							"name": "Fox Illusion",
							"entries": [
								"You know the minor illusion cantrip. At 5th level, you can cast the alter self spell once, requiring no material components, and you regain the ability to cast it this way when you finish a long rest. Charisma is your spellcasting ability for this spell."
							]
						}
					]
				},
				{
					"name": "Okami",
					"source": "Ben's Brew",
					"fluff": {
						"entries": [
							"The okami are the wolf of the dōbutsu world. They are super loyal and often are more lawful than chaotic. The okami fur is often wilder than the other subraces. In the past, they were the strongest warriors in the dōbutsu. They were as crazy as Norse berserkers but also had a strong scene of morals. They have mostly kept the same moral but some have twist law so that they may accomplish their goals."
						]
					},
					"ability": [{
						"str": 1
					}],
					"entries": [{
							"name": "Keen Ears",
							"type": "entries",
							"entries": [
								"You have advantage on Wisdom (Perception) checks that rely on hearing."
							]
						},
						{
							"type": "entries",
							"name": "Relentless Endurance",
							"entries": [
								"When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can’t use this feature again until you finish a long rest."
							]
						}
					]
				},
				{
					"name": "Usagi",
					"source": "Ben's Brew",
					"fluff": {
						"entries": [
							"The Usagi have similarities to rabbits. People usually think of them as being weaker than the other dōbutsu. They often go adventuring having a super high chance of leaving home because of the curiosity inside them. The Usagi have tails and ears that are more glossy and often lick them. The Usagi of the past often were rarely seen unless to give aid to hurt or lost travelers."
						]
					},
					"ability": [{
						"dex": 1
					}],
					"entries": [{
							"name": "Nimble Climber",
							"type": "entries",
							"entries": [
								"Your limbs are strengthened by your animal aspect. You have a climbing speed equal to your walking speed."
							]
						},
						{
							"type": "entries",
							"name": "Rabbit's Agility",
							"entries": [
								"Your reflexes and agility allow you to move with a burst of speed. When you move on your turn in combat, you can double your speed until the end of the tum. Once you use this trait, you can't use it again until you move 0 feet on one of your turns."
							]
						}
					]
				}
			]
		},
		{
			"name": "Oni",
			"source": "Ben's Brew",
			"size": [
				"M"
			],
			"speed": {
				"walk": 30
			},
			"ability": [{
				"str": 1,
				"con": 1
			}],
			"darkvision": 60,
			"languageProficiencies": [{
				"common": true,
				"celestial": true
			}],
			"resist": [
				"poison"
			],
			"entries": [{
					"name": "Age",
					"type": "entries",
					"entries": [
						"Oni reach maturity about the same time as humans do, but their aging slows down drastically after that. Most live to about 1000 years old."
					]
				},
				{
					"name": "Alignment",
					"type": "entries",
					"entries": [
						"Most oni are naturally evil. Their heightened sensitivity to the temptations of the Material Plane usually drives them to steal, fight and manipulate to get what they want."
					]
				},
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"Oni are a sizeable people, reaching heights from 7 and 8 feet tall by maturity and weigh between 280 and 340 pounds. Your size is Medium."
					]
				},
				{
					"name": "Darkvision",
					"entries": [
						"As a creature of the night, you are very good at seeing in the dark. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
					],
					"type": "entries"
				},
				{
					"name": "Yokai Resistance",
					"entries": [
						"Thanks to the energy of the yokai, you have resistance to poison damage and advantage on saving throws against becoming poisoned."
					],
					"type": "entries"
				},
				{
					"name": "Powerful Build",
					"entries": [
						"You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift."
					],
					"type": "entries"
				},
				{
					"name": "Supernatural Strength",
					"entries": [
						"You can wield a weapon with the versatile property in one hand, but use the damage dice as if you were wielding it in two hands. In addition, Half-Oni's add their proficiency bonus to damage when making an unarmed attack."
					],
					"type": "entries"
				},
				{
					"name": "Languages",
					"entries": [
						"You can speak, read and write, Common and Giant."
					],
					"type": "entries"
				}
			],
			"subraces": [{
					"name": "Aka Oni (Red Oni)",
					"source": "Ben's Brew",
					"fluff": {
						"entries": [
							"The most common out of the oni, red oni or aka oni are known for their large size and toughness. They are slightly bigger than the rest of their kin, with skin coloration in shades of dark red. They are violent, hot-headed, and unfocused, often pursuing immediate satisfaction and disregarding long-term plots and schemes."
						]
					},
					"ability": [{
						"dex": 1
					}],
					"entries": [{
						"name": "The Revel Continues",
						"entries": [
							"When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can’t use this feature again until you finish a long rest."
						],
						"type": "entries"
					}]
				},
				{
					"name": "Ao Oni (Blue Oni)",
					"source": "Ben's Brew",
					"ability": [{
						"int": 1
					}],
					"fluff": {
						"entries": [
							"Blue oni or ao oni are known for their unnatural cunning and aptitude for magic. They are smaller than their red kin, though larger than their pale kin, and with skin coloration of shades of dark blue. They are usually calculating and meticulous pursuing lofty goals such as of power and knowledge."
						]
					},
					"entries": [{
						"name": "Oni Magic.",
						"entries": [
							"Blue oni can muster the innate magic within themselves which gets stronger as they grow in power. You know the dancing lights cantrip. When you reach 3rd level, you can cast the charm person spell once and need to finish a long rest before you can cast it again. Intelligence is your spellcasting ability for these spells."
						],
						"type": "entries"
					}]
				},
				{
					"name": "Shiro Oni (White Oni)",
					"source": "Ben's Brew",
					"ability": [{
						"wis": 1
					}],
					"fluff": {
						"entries": [
							"Pale oni or shiro oni are known for their aloofness and connections to the spiritual realm. They are the smallest of oni, and are the fewest. Their skin can vary from pale white to light grey. Unlike the other oni, pale oni wish only to keep the balance between the Spirit World and the Material Plane. They usually guard locations where the presence of the Spirit World but sometimes adventure to seek artifacts of the spirit world or mend imbalances."
						]
					},
					"entries": [{
						"name": "Spirit Walk.",
						"entries": [
							"You teleport when you take the dash action."
						],
						"type": "entries"
					}]
				}
			]
		},
		{
			"name": "Starforged",
			"source": "Ben's Brew",
			"size": [
				"M"
			],
			"speed": {
				"walk": 30
			},
			"ability": [{
				"con": 2,
				"choose": {
					"from": [
						"str",
						"dex",
						"int",
						"wis",
						"cha"
					],
					"count": 1
				}
			}],
			"traitTags": [
				"Starforged Resilience",
				"Natural Armor"
			],
			"languageProficiencies": [{
				"common": true,
				"anyStandard": 1
			}],
			"resist": [
				"cold"
			],
			"conditionImmune": [
				"disease"
			],
			"entries": [{
					"name": "Age",
					"entries": [
						"After achieving sentience, starforged mature at the same age as humans. They can live until their core run out of energy, a process that can take up to 700 years."
					],
					"type": "entries"
				},
				{
					"type": "entries",
					"name": "Alignment",
					"entries": [
						"Most starforged take comfort in order and discipline, tending toward law and neutrality, but some have absorbed the morality—or lack thereof—of the beings they served with."
					]
				},
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"Most starforged stand between 5 and 6½ feet tall. Your size is Medium."
					]
				},
				{
					"type": "entries",
					"name": "Starforged Resilience",
					"entries": [
						"Your constructed and cosmic nature grants you the following benefits:",
						{
							"type": "list",
							"items": [
								"You have resistance to cold damage",
								"You don't need to eat, drink, or breathe.",
								"You are immune to disease.",
								"You don't need to sleep and don't suffer the effects of exhaustion due to lack of rest, and magic can't put you to sleep."
							]
						}
					]
				},
				{
					"type": "entries",
					"name": "Sentry's Rest",
					"entries": [
						"When you take a long rest, you must spend at least six hours in an inactive, motionless state, rather than sleeping. In this state, you appear inert, but it doesn't render you {@condition unconscious}, and you can see and hear as normal."
					]
				},
				{
					"type": "entries",
					"name": "Integrated Protection",
					"entries": [
						"Your body is composed of metal, stone, and strands of starlight. When you aren't wearing armor, your AC is 13 + your Dexterity modifier. You can use your natural armor to determine your AC if the armor you wear would leave you with a lower AC. A shield's benefits apply as normal while you use your natural armor."

					]
				},
				{
					"type": "entries",
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common and one other language of your choice."
					]
				}
			]
		},
		{
			"name": "Automata",
			"source": "Ben's Brew",
			"size": [
				"M"
			],
			"speed": {
				"walk": 30
			},
			"ability": [{
				"con": 1,
				"choose": {
					"from": [
						"str",
						"dex",
						"int",
						"wis",
						"cha"
					],
					"count": 1
				}
			}],
			"languageProficiencies": [{
				"common": true,
				"anyStandard": 1
			}],
			"resist": [
				"poison"
			],
			"conditionImmune": [
				"disease"
			],
			"entries": [{
					"name": "Age",
					"entries": [
						"Automatas don't age in the same way as other races do, but their body slowly decays if not taken care of properly. Automata can survive only for 5 to 50 years, depending on what it is made of, if it doesn't have access to the proper materials or tools required for its maintenance. After that time, it will crumble, rust or rot away. Proper maintenance can make an Automata immortal.",
						"For the purpose of game mechanics, you're immune to biological aging, both magical and non-magical."
					],
					"type": "entries"
				},
				{
					"type": "entries",
					"name": "Alignment",
					"entries": [
						"Built as slaves or servants, most Automatas keep their 'rule - encased ' mentality even when free, and tend therefore towards lawful alignments. They don't seem to show a predilection for good or evil."
					]
				},
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"An Automata's size can vary greatly, ranging from as little as 3 feet to more than 8. Your size is either Medium or Small (your choice). "
					]
				},
				{
					"type": "entries",
					"name": "Artificial being",
					"entries": [
						"Even though you still count as a humanoid, your body doesn't work as the one of any other mortal race. You gain the following additional traits:",
						{
							"type": "list",
							"items": [
								"You have advantage on saving throws against being poisoned, and you have resistance to poison damage.",
								"You are immune to disease.",
								"You can don only armor with which you have proficiency. To don armor other than a shield, you must incorporate it into your body over the course of 1 hour, during which you remain in contact with the armor. To doff armor, you must spend 1 hour removing it. You can rest while donning or doffing armor in this way.",
								"While you live, the armor incorporated into your body can't be removed against your will."
							]
						}
					]
				},
				{
					"type": "entries",
					"name": "Not far from humanoids.",
					"entries": [
						"Even though you are not made of flesh and bone (at least in most cases), you still need to enter a 'sleeping ' state for 6 hours a day, like a normal person would, though it's more like a temporary shut-down to you. Most Automatas can't dream.','Also, you don't necessarily need to eat, but you do require to consume some kind of energy in order to keep yourself active: it could be sunlight, coal, or even food. The DM will decide whether your choice of power source is eligible or not. In order to keep all your systems functioning you also require air (be it for some kind of chemical/ magical/ photosynthetic reaction that happens inside you or something else) like a normal human would."
					]
				},
				{
					"type": "entries",
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common and one other language of your choice."
					]
				}
			],
			"subraces": [{
					"name": "Geo-Construct",
					"source": "Ben's Brew",
					"entries": [{
						"name": "Geo-Construct",
						"type": "entries",
						"entries": [
							"You are composed of mostly inorganic matter, be it metal, stone or crystals. You gain the following traits:",
							{
								"type": "list",
								"items": [
									"You gain immunity to poison damage and the poisoned condition.",
									"You don't need to eat, drink, or breathe.",
									"When you are reduced to 0 hit points but not killed outright, you can use your reaction to drop to 1 hit point instead. You cannot use this feature again until you finish a long rest."
								]
							}
						]
					}]

				},
				{
					"name": "Dendro-Contruct",
					"source": "Ben's Brew",
					"entries": [{
						"name": "Dendro-Contruct",
						"type": "entries",
						"entries": [
							"You are made of wood and other plant-derived materials, causing your body to work similarly to a plant. You gain the following traits:",
							{
								"type": "list",
								"items": [
									"You do not need to sleep. Instead, you can rest by doing light activity while remaining relative still (like keeping watch or reading a book).",
									"You do not need to eat or drink as long as you have access to sunlight or a good amount of soil.",
									"You can go 1 hour without breathing without suffering ill consequences.",
									"You gain proficiency in the Nature or Survival skills."
								]
							}
						]
					}]
				},
				{
					"name": "Necro-Construct",
					"source": "Ben's Brew",
					"entries": [{
						"name": "Geo-Construct",
						"type": "entries",
						"entries": [
							"Your body is constructed using organic matter in the necromantic way, and thus share characteristics of an undead. You gain the following traits:",
							{
								"type": "list",
								"items": [
									"You gain resistance to necrotic damage.",
									"You have advantage on checks and saving throws to avoid exhaustion.",
									"You can go 1 hour without breathing without suffering ill consequences.",
									"You have some form of innate magic implanted into your system. You learn one cantrip. Choose the cantrip from the bard, cleric, druid, sorcerer, warlock, or wizard spell list. Your spellcasting ability for this cantrip depends on the spell list you chose from: Charisma for bard, sorcerer, or warlock; Wisdom for cleric or druid; or Intelligence for wizard."
								]
							}
						]
					}]
				}
			]
		}

	]


}
